[Demo_Tutorial_Shooting_ENG GG2CollectionDemoScript]
DemoScripts[0]=(Actor=CAMERA,Command=SET,SetType=POS,Vec=(X=0,Y=0,Z=0),SecTime=)
DemoScripts[1]=(Actor=CAMERA,Command=SET,SetType=ROT,Vec=(X=0,Y=0,Z=0),SecTime=)
DemoScripts[2]=(Actor=SYSTEM,Command=INIT_WAIT)
DemoScripts[3]=(Actor=TUT_TEXTURE,Command=START,CId=0,Bit=0)
DemoScripts[4]=(Actor=BGM,Command=PLAY,SecTime=0,SoundID=SoundCue'GG2_BGM_DM_Usual_Ekoro.GG2_BGM_DM_Usual_Ekoro_Cue')
DemoScripts[5]=(Actor=FADE,Command=EXIT,SecTime=1,FadeColor=FADE_COLOR_WHITE,FadePriority=FADE_PRIO_FRONT)
DemoScripts[6]=(Actor=FADE,Command=WAIT)
DemoScripts[7]=(Actor=WINDOW,Command=SET)
DemoScripts[8]=(Actor=SYSTEM,Command=TAG,Label=JUMP01)
DemoScripts[9]=(Actor=TUT_TEXTURE,Command=SET,CId=1,Bit=1)
DemoScripts[10]=(Actor=TEXT,Command=SET,ID=TEXT01)
DemoScripts[11]=(Actor=TEXT,Command=SET,ID=TEXT02)
DemoScripts[12]=(Actor=TEXT,Command=SET,ID=TEXT03)
DemoScripts[13]=(Actor=TEXT,Command=SET,ID=TEXT04)
DemoScripts[14]=(Actor=TEXT,Command=SET,ID=TEXT05)
DemoScripts[15]=(Actor=TUT_TEXTURE,Command=CROSS_FADE,CId=2,Bit=2)
DemoScripts[16]=(Actor=TEXT,Command=SET,ID=TEXT06)
DemoScripts[17]=(Actor=TEXT,Command=SET,ID=TEXT07)
DemoScripts[18]=(Actor=TEXT,Command=SET,ID=TEXT08)
DemoScripts[19]=(Actor=TUT_TEXTURE,Command=CROSS_FADE,CId=3,Bit=3)
DemoScripts[20]=(Actor=TEXT,Command=SET,ID=TEXT09)
DemoScripts[21]=(Actor=TEXT,Command=SET,ID=TEXT10)
DemoScripts[22]=(Actor=TUT_TEXTURE,Command=CROSS_FADE,CId=4,Bit=4)
DemoScripts[23]=(Actor=TEXT,Command=SET,ID=TEXT11)
DemoScripts[24]=(Actor=TEXT,Command=SET,ID=TEXT12)
DemoScripts[25]=(Actor=TUT_TEXTURE,Command=CROSS_FADE,CId=5,Bit=5)
DemoScripts[26]=(Actor=TEXT,Command=SET,ID=TEXT13)
DemoScripts[27]=(Actor=TEXT,Command=SET,ID=TEXT14)
DemoScripts[28]=(Actor=TEXT,Command=SET,ID=TEXT15)
DemoScripts[29]=(Actor=TEXT,Command=SET,ID=TEXT16)
DemoScripts[30]=(Actor=SELECT,Command=SET,ID=SELECT00)
DemoScripts[31]=(Actor=SYSTEM,Command=TAG,Label=JUMP02)
DemoScripts[32]=(Actor=WINDOW,Command=EXIT)
DemoScripts[33]=(Actor=FADE,Command=SET,SecTime=1,FadeColor=FADE_COLOR_WHITE,FadePriority=FADE_PRIO_FRONT)
DemoScripts[34]=(Actor=BGM,Command=STOP,SecTime=2,SoundID=)
DemoScripts[35]=(Actor=SYSTEM,Command=WAIT,SecTime=2)
DemoScripts[36]=(Actor=SYSTEM,Command=END)

[Select_Tutorial_Shooting_ENG GG2CollectionSelect]
Selects[0]=(Label="SELECT00",SelectNumber=2,Select[0]=(TextLabel="SELECT01",Goto="JUMP01",ParamType=NO_PARAM,ParamNum=0),Select[1]=(TextLabel="SELECT02",Goto="JUMP02",ParamType=NO_PARAM,ParamNum=0),Select[2]=(TextLabel="SELECT03",Goto="JUMP03",ParamType=NO_PARAM,ParamNum=0),Select[3]=(TextLabel="SELECT04",Goto="JUMP04",ParamType=NO_PARAM,ParamNum=0),Select[4]=(TextLabel="SELECT05",Goto="JUMP05",ParamType=NO_PARAM,ParamNum=0))
Selects[1]=(Label="SELECT01",SelectNumber=5,Select[0]=(TextLabel="SELECT06",Goto="JUMP06",ParamType=NO_PARAM,ParamNum=0),Select[1]=(TextLabel="SELECT07",Goto="JUMP07",ParamType=NO_PARAM,ParamNum=0),Select[2]=(TextLabel="SELECT08",Goto="JUMP08",ParamType=NO_PARAM,ParamNum=0),Select[3]=(TextLabel="SELECT09",Goto="JUMP09",ParamType=NO_PARAM,ParamNum=0),Select[4]=(TextLabel="SELECT10",Goto="JUMP10",ParamType=NO_PARAM,ParamNum=0))

[Text_Tutorial_Shooting_ENG GG2CollectionText]
Texts[0]=(Label="TEXT01",Name="???",Text="咦? 沒有說明就什麼都不會......是嗎?/n真拿你沒辦法耶,這裡就由我親自來/n為你說明費洛蒙射擊的事情吧.")

Texts[1]=(Label="TEXT02",Name="???",Text="在射擊部分當中/n用L操控搖桿移動視點/n然後按Y鍵發射費洛蒙射擊.")

Texts[2]=(Label="TEXT03",Name="???",Text="將視點和女孩子重合後按下Y鍵./n這是一切的基本!")

Texts[3]=(Label="TEXT04",Name="???",Text="只要射擊命中並讓女孩子昇天,/n就能夠取得受歡迎點數.")

Texts[4]=(Label="TEXT05",Name="???",Text="精心力就相當於峯大大人的剩餘體力./n要是歸零的話就會走向事與願違的結局....../n請多加註意!")

Texts[5]=(Label="TEXT06",Name="???",Text="女孩子身上有著弱點./n會是頭,胸,腰,腳4個地方其中之一,/n但是每個女孩子的弱點位置不盡相同.")

Texts[6]=(Label="TEXT07",Name="???",Text="把視點重合在女孩子身上,/n出現像是\"ドキッ\"或\"キュン\"反應的部位,/n請不要放過,進行射擊吧!")

Texts[7]=(Label="TEXT08",Name="???",Text="如果順利擊中弱點的話,/n會變成快感射擊,能夠得到/n更多的受歡迎點數唷!")

Texts[8]=(Label="TEXT09",Name="???",Text="長按射擊鍵能夠進行蓄力./n蓄力到最大後再射擊的話/n就能夠讓女孩子的動作停下來.")

Texts[9]=(Label="TEXT10",Name="???",Text="蓄力射擊還能夠把著彈點周圍/n一定範圍內的女孩子也捲進來唷./n請好好參透使用的時機吧.")

Texts[10]=(Label="TEXT11",Name="???",Text="按住R鍵的時候會進行放大./n放大中能夠看穿障礙物,/n或是看見平常看不到的東西.")

Texts[11]=(Label="TEXT12",Name="???",Text="如果用放大檢視各式各樣的地方/n或許會有新的發現也說不定呢./n可不能用來做壞事喔!")

Texts[12]=(Label="TEXT13",Name="???",Text="另外還可以用L鍵調整視點移動速度,/n或是按X鍵發動心跳模式,/n而+鍵則是能夠暫停.")

Texts[13]=(Label="TEXT14",Name="???",Text="在分歧點,或是受到來自多方向的襲擊時,/n畫面上會顯示箭頭.這時請利用/n方向鍵的上下左右來指定方向.")

Texts[14]=(Label="TEXT15",Name="???",Text="之後可以在設定選項裡/n設定按鍵配置,如果不喜歡的話/n就請依照自己的喜好變更吧.")

Texts[15]=(Label="TEXT16",Name="???",Text="那麼,峯大大人,是時候實踐了./n請拿出幹勁前進吧!")

Texts[16]=(Label="",Name="",Text="")

Texts[17]=(Label="SELECT01",Name="",Text="重來一次")

Texts[18]=(Label="SELECT02",Name="",Text="沒問題了")


